{
  "answersArray": [
    {"firstAnswer": "Работать над созданием приложений с виртуальной или дополненной реальностью",
      "secondAnswer": "Делать из макетов дизайнеров красивые и аккуратные сайты","sphere":["mob","front"]},
    {"firstAnswer": "Создавать в мобильном приложении плавные переходы и интересные анимации",
      "secondAnswer": "Придумывать новые и нетривиальные способы поиска ошибок","sphere":["mob","qa"] },
    {"firstAnswer": "Делать мобильное приложение удобным и комфортным для пользователя",
      "secondAnswer": "Делать важную, но малозаметную работу: оптимизировать, настраивать и обеспечивать надежность сайта","sphere":["mob","full"]},
    {"firstAnswer":"Программировать сайты так, чтобы на любых устройствах они отображались хорошо",
      "secondAnswer": "Искать ошибки и придумывать способы, как лучше их исправить","sphere":["front","qa"]},
    {"firstAnswer": "Быть специалистом, от внимания которого не ускользнет ни один сдвинутый пиксель",
      "secondAnswer":"Уметь делать всю работу целиком - от идеи и до последней строчки кода","sphere":["qa","full"]},
    {"firstAnswer": "Делать сайты удобными и понятными для пользователей",
      "secondAnswer": "Разносторонне продумывать логику и внутреннюю структуру будущей программы","sphere":["front","full"]},
    {"firstAnswer": "Активно использовать в программировании микрофон, камеру, геолокацию и др. функции мобильного телефона",
      "secondAnswer": "Делать сайты комфортными для людей с ограниченными возможностями","sphere":["mob","front"]},
    {"firstAnswer": "Работать над программированием новых фишек мобильного приложения",
      "secondAnswer": "Придумывать программы, которые автоматически ищут ошибки", "sphere":["mob","qa"]},
    {"firstAnswer":"Внедрять в мобильное приложение аналитику поведения пользователя",
      "secondAnswer": "Уметь одинаково хорошо и настраивать операционные системы, и программировать сайты","sphere":["mob","full"]},
    {"firstAnswer": "Создавать на сайте интересные эффекты и анимации",
      "secondAnswer":"Педантично, шаг за шагом, проверять правильность работы каждой детали","sphere":["front","qa"]},
    {"firstAnswer": "Программировать различные детали сайта - кнопки, прогресс-бары и др.",
      "secondAnswer":"Анализировать разнородные данные и собирать их в единое целое","sphere":["front","full"]},
    {"firstAnswer": "Находить даже минимальные расхождения между тем, как должна работать программа, и тем, как она работает сейчас",
      "secondAnswer": "Разбираться во всех областях программирования, пусть даже и поверхностно","sphere":["qa","full"]}
  ],
  "QA":"Тестировщик или QA-Инженер – это специалист, который отвечает за  безошибочную работу и качество продукта. Он тестирует продукт, ищет возможные ошибки и сообщает о найденных. Тестировщики также могут писать автоматизированные тесты для проверки работы кода программистов. Данная специальность крайне популярна на начальных этапах, так как не всегда требует знаний языков программирования и глубокого понимания современных технологий.",
  "QASecondParagraph": "Поэтому специальность тестировщика – отличная возможность начать IT карьеру, вне зависимости от имеющихся технических знаний.",
  "FRONTEND": "Фронтенд-разработчик – это программист, отвечающий за разработку внешнего вида сайта и его соответствие макету. Такой специалист гарантирует единообразное отображение страниц сайта в любом браузере. Именно от него зависит, насколько удобным и функциональным будет интерфейс сайта или веб-приложения.",
  "FRONTENDSecondParagraph": "В случаях, если макет не отражает деталей концепта, фронтенд-разработчик может проявлять свои дизайнерские навыки,занимаясь версткой уже готового макета (с помощью связки HTML+CSS).",
  "FULLSTACK":"Fullstack веб-разработчик – это программист, который способен принимать активное участие во всех этапах разработки: начиная с разработки серверной логики будущего приложения и заканчивая клиентским кодом, работающим в браузере. Наиболее ценно в таком специалисте умение планировать структуру приложения, представлять, как все его части будут взаимодействовать друг с другом и с внешними компонентами.",
  "FULLSTACKSecondParagraph": "Первостепенная задача – обеспечить создание правильного скелета приложения, который в дальнейшем выдержит нарастающую нагрузку в виде новых фич и компонентов. Fullstack-разработчик может самостоятельно сделать свое приложение “под ключ”",
  "MOBILE": "Мобильный разработчик — это специалист, разрабатывающий программные приложения для различных мобильных устройств: планшетов, смартфонов. Сейчас эта профессия очень популярная, перспективная и востребованная.",
  "QAlinks":["https://stepik.org/course/575/syllabus"], "FRONTENDlinks":["https://stepik.org/course/100971/"],
  "FULLSTACKlinks": ["https://stepik.org/course/183142/","https://stepik.org/course/82541"],
  "MOBILElinks":["https://stepik.org/course/5703/","https://stepik.org/course/96413"],
  "QAnames": ["Тестировщик Selenium"], "FRONTENDnames":["Frontend-разработчик с нуля"],
  "FULLSTACKnames":["FullStack Pro MAX","Python-для профессионалов"],
  "MOBILEnames":["Android-разработчик","Glide-разработчик"],
  "QADisplayName": "Тестировщик",
  "FRONTENDDisplayName": "Frontend-разработчик",
  "FULLSTACKDisplayName": "Fullstack-разработчик","MOBILEDisplayName": "Мобильный разработчик"
}
